cask_args appdir: '/Applications'

tap "caskroom/cask"

# Editors
# cask "visual-studio-code"
cask "sublime-text"
cask "pycharm"
brew "emacs"

# Terminal
cask "iterm2"

# Shell
# brew "fish"

# Languages
brew "python3"
# brew "node"
brew "mit-scheme"

# Tools
brew "curl"
brew "git"
brew "wget"
brew "ack"
brew "git-flow"
brew "p7zip"
cask "vlc"
cask "meld"
# brew "pre-commit"
cask "flux"
cask "gimp"
cask "github-desktop"

# Browsers
cask "google-chrome"
cask "firefox"
# cask "torbrowser"

# Cloud CLI
cask "google-cloud-sdk"
# brew "awscli"
# brew "firebase-cli"

# Database
brew "postgresql"
# brew "mysql"
# cask "dbeaver-community"

# Optional
# cask "slack"
# cask "lastpass"
